{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1, 512, 512], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"strides": [1, 1], "filters": 32, "name": "conv2d_1", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"strides": [1, 1], "filters": 32, "name": "conv2d_2", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"strides": [1, 1], "filters": 64, "name": "conv2d_3", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2", "config": {"seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"strides": [1, 1], "filters": 64, "name": "conv2d_4", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"strides": [1, 1], "filters": 128, "name": "conv2d_5", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3", "config": {"seed": null, "noise_shape": null, "name": "dropout_3", "rate": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"strides": [1, 1], "filters": 128, "name": "conv2d_6", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"strides": [1, 1], "filters": 256, "name": "conv2d_7", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4", "config": {"seed": null, "noise_shape": null, "name": "dropout_4", "rate": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"strides": [1, 1], "filters": 256, "name": "conv2d_8", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"strides": [2, 2], "filters": 128, "data_format": "channels_first", "name": "conv2d_transpose_1", "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "output_padding": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_size": [2, 2]}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": 1, "name": "concatenate_1", "trainable": true}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"strides": [1, 1], "filters": 128, "name": "conv2d_9", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_5", "config": {"seed": null, "noise_shape": null, "name": "dropout_5", "rate": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"strides": [1, 1], "filters": 128, "name": "conv2d_10", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"strides": [2, 2], "filters": 64, "data_format": "channels_first", "name": "conv2d_transpose_2", "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "output_padding": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_size": [2, 2]}}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2", "config": {"axis": 1, "name": "concatenate_2", "trainable": true}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"strides": [1, 1], "filters": 64, "name": "conv2d_11", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_6", "config": {"seed": null, "noise_shape": null, "name": "dropout_6", "rate": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"strides": [1, 1], "filters": 64, "name": "conv2d_12", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"strides": [2, 2], "filters": 32, "data_format": "channels_first", "name": "conv2d_transpose_3", "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "output_padding": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_size": [2, 2]}}, {"inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3", "config": {"axis": 1, "name": "concatenate_3", "trainable": true}}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"strides": [1, 1], "filters": 32, "name": "conv2d_13", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_7", "config": {"seed": null, "noise_shape": null, "name": "dropout_7", "rate": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"strides": [1, 1], "filters": 32, "name": "conv2d_14", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "data_format": "channels_first", "kernel_size": [5, 5]}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"strides": [1, 1], "filters": 1, "name": "conv2d_15", "bias_regularizer": null, "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_first", "kernel_size": [1, 1]}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_15", 0, 0]], "name": "model_1"}}